Reshaping data with the Melt function
Scenario: As a business analyst you have been given a data in the wide format and you want to change it to the long format. Using the wide format you cannot see insight like trends and also generate relationships across different variables. Let us examine one scenario

NB:I have faced this challenge also in my previous work where we struggled to reshape datasets

In [1]:
import pandas as pd

In [28]:
df_wide = pd.DataFrame({"Sales_Representative":["Musa","John","Paul"],"1993_Sales":[0,1000,2500],"1994_Sales":[3000,2060,5000],"1995_sales":[4100,2400,1200]})

In [29]:
df_wide #the data set extracted from the company

  Sales_Representative  1993_Sales  1994_Sales  1995_sales
0                 Musa           0        3000        4100
1                 John        1000        2060        2400
2                 Paul        2500        5000        1200

We just said this format limits youre analysis and we shall change it into the long format.Using the pandas melt function:For more information on this please visit this website https://pandas.pydata.org/docs/reference/api/pandas.melt.html

In [30]:
df_long=pd.melt(df_wide,id_vars=["Sales_Representative"],var_name="Sales_Per_Year",value_name="Sales_In_Units")

df_long

  Sales_Representative Sales_Per_Year  Sales_In_Units
0                 Musa     1993_Sales               0
1                 John     1993_Sales            1000
2                 Paul     1993_Sales            2500
3                 Musa     1994_Sales            3000
4                 John     1994_Sales            2060
5                 Paul     1994_Sales            5000
6                 Musa     1995_sales            4100
7                 John     1995_sales            2400
8                 Paul     1995_sales            1200

You can now see the observations are spread across years , Representatives and the Sales in Units

In [31]:
df_long.sort_values(by=["Sales_Representative"],inplace=True)

In [32]:
df_long #Sorting by Sales representative

  Sales_Representative Sales_Per_Year  Sales_In_Units
1                 John     1993_Sales            1000
4                 John     1994_Sales            2060
7                 John     1995_sales            2400
0                 Musa     1993_Sales               0
3                 Musa     1994_Sales            3000
6                 Musa     1995_sales            4100
2                 Paul     1993_Sales            2500
5                 Paul     1994_Sales            5000
8                 Paul     1995_sales            1200